#include "baseswidget.h"
#include "customdoublevalidator.h"

/*!
 * \brief  Конструктор по умолчанию
 ***********************************************************************************/
BasesWidget::BasesWidget()
{
    base1 = nullptr;
    base2 = nullptr;
    base3 = nullptr;
}
/*!
 * \brief     Адаптер для установки графического элемента первой базы
 * \param[in] указатель на объект лайнэдита для первой базы
 ***********************************************************************************/
void BasesWidget::setBase1(QLineEdit *base)
{
    base1 = base;
    base1->setValidator(new CustomDoubleValidator(0, 99.99, 10));
}
/*!
 * \brief     Адаптер для установки графического элемента второй базы
 * \param[in] указатель на объект лайнэдита для второй базы
 ***********************************************************************************/
void BasesWidget::setBase2(QLineEdit *base)
{
    base2 = base;
    base2->setValidator(new CustomDoubleValidator(0, 99.99, 10));
}
/*!
 * \brief     Адаптер для установки графического элемента третьей базы
 * \param[in] указатель на объект лайнэдита для третьей базы
 ***********************************************************************************/
void BasesWidget::setBase3(QLineEdit *base)
{
    base3 = base;
    base3->setValidator(new CustomDoubleValidator(0, 99.99, 10));
}
/*!
 * \brief     Получение значения первой базы из графического элемента
 * \return    значение в метрах
 ***********************************************************************************/
double BasesWidget::getBase1Value()
{
    return base1->text().toDouble();
}
/*!
 * \brief     Получение значения второй базы из графического элемента
 * \return    значение в метрах
 ***********************************************************************************/
double BasesWidget::getBase2Value()
{
    return base2->text().toDouble();
}
/*!
 * \brief     Получение значения третьей базы из графического элемента
 * \\return   значение в метрах
 ***********************************************************************************/
double BasesWidget::getBase3Value()
{
    return base3->text().toDouble();
}
/*!
 * \brief     Установка значения графического элемента первой базы
 * \param[in] значение в метрах
 ***********************************************************************************/
void   BasesWidget::setBase1Value(double val)
{
    base1->setText(QString::number(val));
}
/*!
 * \brief     Установка значения графического элемента второй базы
 * \param[in] значение в метрах
 ***********************************************************************************/
void   BasesWidget::setBase2Value(double val)
{
    base2->setText(QString::number(val));
}
/*!
 * \brief     Установка значения графического элемента третьей базы
 * \param[in] значение в метрах
 ***********************************************************************************/
void   BasesWidget::setBase3Value(double val)
{
    base3->setText(QString::number(val));
}
/*!
 * \brief     Очистка значения графического элемента первой базы
 ***********************************************************************************/
void   BasesWidget::cleanBase1()
{
    base1->clear();
}
/*!
 * \brief     Очистка значения графического элемента второй базы
 ***********************************************************************************/
void   BasesWidget::cleanBase2()
{
    base2->clear();
}
/*!
 * \brief     Очистка значения графического элемента третьей базы
 ***********************************************************************************/
void   BasesWidget::cleanBase3()
{
    base3->clear();
}
/*!
 * \brief     Активировать графические элементы СУ-М
 ***********************************************************************************/
void BasesWidget::setEnable()
{
    base1->setEnabled(true);
    base2->setEnabled(true);
    base3->setEnabled(true);
}
/*!
 * \brief     Деактивировать графические элементы СУ-М
 ***********************************************************************************/
void BasesWidget::setDisable()
{
    base1->setEnabled(false);
    base2->setEnabled(false);
    base3->setEnabled(false);
}
