#ifndef BASESWIDGET_H
#define BASESWIDGET_H

#include <QLineEdit>

/*!
 * \brief  Класс для управления графическим элементом баз СУ-М
 ***********************************************************************************/
class BasesWidget
{

public:
    /* Открытые методы */
    /*!
     * \brief  Конструктор по умолчанию
     ***********************************************************************************/
    BasesWidget();
    /*!
     * \brief     Адаптер для установки графического элемента первой базы
     * \param[in] указатель на объект лайнэдита для первой базы
     ***********************************************************************************/
    void setBase1(QLineEdit *base);
    /*!
     * \brief     Адаптер для установки графического элемента второй базы
     * \param[in] указатель на объект лайнэдита для второй базы
     ***********************************************************************************/
    void setBase2(QLineEdit *base);
    /*!
     * \brief     Адаптер для установки графического элемента третьей базы
     * \param[in] указатель на объект лайнэдита для третьей базы
     ***********************************************************************************/
    void setBase3(QLineEdit *base);
    /*!
     * \brief     Получение значения первой базы из графического элемента
     * \return    значение в метрах
     ***********************************************************************************/
    double getBase1Value();
    /*!
     * \brief     Получение значения второй базы из графического элемента
     * \return    значение в метрах
     ***********************************************************************************/
    double getBase2Value();
    /*!
     * \brief     Получение значения третьей базы из графического элемента
     * \\return   значение в метрах
     ***********************************************************************************/
    double getBase3Value();
    /*!
     * \brief     Установка значения графического элемента первой базы
     * \param[in] значение в метрах
     ***********************************************************************************/
    void   setBase1Value(double val);
    /*!
     * \brief     Установка значения графического элемента второй базы
     * \param[in] значение в метрах
     ***********************************************************************************/
    void   setBase2Value(double val);
    /*!
     * \brief     Установка значения графического элемента третьей базы
     * \param[in] значение в метрах
     ***********************************************************************************/
    void   setBase3Value(double val);
    /*!
     * \brief     Очистка значения графического элемента первой базы
     ***********************************************************************************/
    void   cleanBase1();
    /*!
     * \brief     Очистка значения графического элемента второй базы
     ***********************************************************************************/
    void   cleanBase2();
    /*!
     * \brief     Очистка значения графического элемента третьей базы
     ***********************************************************************************/
    void   cleanBase3();
    /*!
     * \brief     Активировать графические элементы СУ-М
     ***********************************************************************************/
    void setEnable();
    /*!
     * \brief     Деактивировать графические элементы СУ-М
     ***********************************************************************************/
    void setDisable();
private:
    QLineEdit *base1; //! указатель на лайнэдит первой базы (адаптер)
    QLineEdit *base2; //! указатель на лайнэдит второй базы (адаптер)
    QLineEdit *base3; //! указатель на лайнэдит третьей базы (адаптер)
};

#endif // BASESWIDGET_H
