#ifndef MASTERSLAVEWIDGET_H
#define MASTERSLAVEWIDGET_H

#include "blockbtn.h"

#define STYLE_SETTINGS \
    ":enabled {" \
    "background-color: rgb(0, 128, 64);" \
    "border-radius: 5px;" \
    "}" \
    ":disabled {" \
    "background-color: rgb(143, 143, 143);" \
    "border-radius: 5px;" \
    "}"

/*!
 * \brief Класс графического отображения блоков СУ 02
 ***********************************************************************************/
class MasterSlaveWidget : public QObject
{
    Q_OBJECT

public:
    /* Списки */
    //! \brief Список возможных расположений, которые поддерживает виджет
    enum Arrangment{
      Collinear = 0,    // соосное
      Parallel,         // параллельное
      MaxArrangment
    };

    /* Открытые методы */
    /*!
     * \brief     Конструктор класса для графического отображения блоков СУ 02
     ***********************************************************************************/
    MasterSlaveWidget();
    /*!
     * \brief     Инициализация графического элемента (спец. кнопки) для СУ-М
     * \param[in] указатель на спец. кнопку
     ***********************************************************************************/
    void setMasterElement(BlockBtn *master);
    /*!
     * \brief     Инициализация графического элемента (спец. кнопки) для СУ-S
     * \param[in] указатель на спец. кнопку
     ***********************************************************************************/
    void setSlaveElement(BlockBtn *slave);
    /*!
     * \brief     Активация/дизактивация элемента
     * \param[in] true - активировать, false - дизактивировать
     ***********************************************************************************/
    void setEnable(bool state);
    /*!
     * \brief     Получение текущего расположения СУ 02 на виджете
     * \param[in] true - активировать, false - дизактивировать
     ***********************************************************************************/
    Arrangment getElementsArrangment() const;

    /* Открытые слоты */
public slots:
    /*!
     * \brief     Элементы СУ-М и СУ-S меняются местами (СЛОТ)
     ***********************************************************************************/
    void swapElementsSlot();
    /*!
     * \brief     Установка расположения СУ 02 на виджете(СЛОТ)
     * \param[in] идентификатор рассположения
     ***********************************************************************************/
    void setElementsArrangmentSlot(Arrangment arrangment);

    /* Закрытые члены */
private:
    Arrangment arrangment;  //! текущее расположение
    BlockBtn   *masterBtn;  //! Указатель на объект СУ-М (возможно полностью инкапсулировать ???)
    BlockBtn   *slaveBtn;   //! Указатель на объект СУ-S (возможно полностью инкапсулировать ???)
};

#endif // MASTERSLAVEWIDGET_H
