#ifndef MODECFG_H
#define MODECFG_H

#include <QCheckBox>
#include <QRadioButton>
#include <QComboBox>
#include <QObject>

/* Описание класса */
/*!
 * \brief  Класс для управления элементами графического интерфеса режима работы СУ 02
 ***********************************************************************************/
class ModeCfg : public QObject
{
    Q_OBJECT
public:
    /* Открытые списки */
    //! \brief Список возможных расположений устройств в режиме СУ 02
    enum Positions{
        Position_Parallel = 0,        // параллельно
        Position_Collinear,       // соосно
        Position_Collinear_Turn,  // соосно развёрнуто
        Position_Max
    };
    /* Открытые структуры */
    //! \brief Структура с текущей конфигурацией
    typedef struct
    {
        bool      mode;             // true - режим СУ 02 включен
        bool      slaveForwardSign; // false - ведомый сзади, true - ведомый впереди
        Positions position;
    }MODECFG, *MODECFGptr;

    /* Открытые методы */
    /*!
     * \brief  Конструктор по умолчанию
     ***********************************************************************************/
    ModeCfg();
    /*!
     * \brief     Адаптер для задания внешнего чекбокса, который отвечает за вкл/выкл режима СУ 02
     * \param[in] указатель на объект чекбокса
     ***********************************************************************************/
    void            setUsageCheckbox(QCheckBox    *chbox);
    /*!
     * \brief     Адаптер для задания внешнего комбобокса в котором содержится список вариантов размещения устройств
     * \param[in] указатель на объект комбобокса
     ***********************************************************************************/
    void            setPositionCombox(QComboBox *cbox);
    /*!
     * \brief     Адаптер для задания внешнего комбобокса в котором содержится список устройств для соосного расположения
     * \param[in] указатель на объект комбобокса
     ***********************************************************************************/
    void            setActiveBlockCombox(QComboBox *cbox);
    /*!
     * \brief     Установка режима СУ 02 для графического интерфейса
     * \param[in] ссылка на структуру с конфигурацией
     ***********************************************************************************/
    void             setMode(MODECFG &cfg);
    /*!
     * \brief     Получение текущей конфигурации режима СУ 02 графического интерфейса
     * \return    структура с текущей конфигурацией
     ***********************************************************************************/
    ModeCfg::MODECFG getMode();
    /*!
     * \brief     Деактивировать графические элементы режима СУ 02
     ***********************************************************************************/
    void             setDisable();
    /*!
     * \brief     Активировать графические элементы режима СУ 02
     ***********************************************************************************/
    void             setEnable();
    /*!
     * \brief     Деактивировать комбобокс блока соосного размещения
     ***********************************************************************************/
    void             setDisableActiveBlockCbox();
    /*!
     * \brief     Активировать комбобокс блока соосного размещения
     ***********************************************************************************/
    void             setEnableActiveBlockCbox();
    /*!
     * \brief     Установить в комбобоксе значение первого блока
     ***********************************************************************************/
    void             setActiveBlock1();
    /*!
     * \brief     Установить в комбобоксе значение второго блока
     ***********************************************************************************/
    void             setActiveBlock2();
    /* Сигналы */
signals:
    /*!
     * \brief     Сигнал об установке нового варианта размещения СУ 02 в комбобоксе
     ***********************************************************************************/
    void    positionChangedSignal(Positions id);
    /*!
     * \brief     Сигнал выбора нового устройства в комбобке при соосном размещении
     ***********************************************************************************/
    void    activeBlockChangedSignal(int index);
    /*!
     * \brief     Сигнал чекбокса
     ***********************************************************************************/
    void   checkBoxSignal(int state);
private:
    /* Закрытые члены */
    QCheckBox    *usageCheckBox;       //! Указатель на чекбокс который отвечает за вкл/выкл режима СУ 02 (адаптер)
    QComboBox    *modeListCombox;      //! Указатель на комбобокс в котором содержится список вариантов размещения устройств в режиме СУ 02 (адаптер)
    QComboBox    *activeBlockCombobox; //! Указатель на комбобокс в котором содержится список устроиств для которого производится конфигурация (адаптер)
    MODECFG      currentMode;          //! Структура с текущими настройками режима СУ 02
};

#endif // MODECFG_H
